# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
spisok = [2, 3, 5, 9, 3]


def sum_of_odd_elements(spisok):
    summa = 0
    for i in range(len(spisok)):
        if i % 2 != 0:
            summa += spisok[i]
    print(f'Сумма нечетных позиций: = {summa}')


sum_of_odd_elements(spisok)


# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
def the_product_of_pairs_of_list_numbers(spisok):
    l = len(spisok) // 2 + 1 \
        if len(spisok) % 2 != 0 \
        else len(spisok) // 2
    new_lst = [spisok[i] * spisok[len(spisok) - i - 1]
               for i in range(l)]
    print(new_lst)


spisok = [2, 3, 4, 5, 6]
the_product_of_pairs_of_list_numbers(spisok)

# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19


# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

s = ""
n = int(input("Введите число:\n"))
while n != 0:
    s = str(n % 2) + s
    n //= 2
print(s)

# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи](https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8#:~:text=%D0%92%20%D0%BC%D0%B0%D1%82%D0%B5%D0%BC%D0%B0%D1%82%D0%B8%D0%BA%D0%B5%2C%20%D1%87%D0%B8%D1%81%D0%BB%D0%B0%20%D0%BD%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8%20%E2%80%94%20%D0%BE%D1%82%D1%80%D0%B8%D1%86%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%20%D0%B8%D0%BD%D0%B4%D0%B5%D0%BA%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D1%8B%D0%B5%20%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8%20%D1%87%D0%B8%D1%81%D0%B5%D0%BB%20%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8.)
n = int(input('Введите число: '))


def fibonacci(n):
    fibo_nums = []
    a, b = 1, 1
    for i in range(n - 1):
        fibo_nums.append(a)
        a, b = b, a + b
    a, b = 0, 1
    for i in range(n):
        fibo_nums.insert(0, a)
        a, b = b, a - b
    return fibo_nums


fibo_nums = fibonacci(n)
print(fibonacci(n))
print(fibo_nums.index(0))
